app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT * FROM "blogs"

  def show
    @blog = Blog.find(params[:id], :include => :tags)
---
SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)

  def create
    @blog = Blog.new(params[:blog])
    @blog.user_id = current_user.id

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("updated_at", "title", "body", "author_id", "user_id", "created_at") VALUES('2009-04-11 06:07:57', 'First Blog', 'This is my first blog post.', NULL, NULL, '2009-04-11 06:07:57')