app/controllers/discussions_controller.rb

SELECT * FROM "discussions"
---
  def index
    @discussions = Discussion.all

SELECT * FROM "discussions" WHERE ("discussions"."id" = 1)
---
  def show
    @discussion = Discussion.find(params[:id])

INSERT INTO "discussions" ("rating", "answered", "updated_at", "title", "body", "user_id", "parent_id", "created_at") VALUES(NULL, 'f', '2009-04-11 06:06:35', 'What''s this like?', 'I don''t think this is going to be a great discussion.', NULL, NULL, '2009-04-11 06:06:35')
---
  def create
    @discussion = Discussion.new(params[:discussion])

    respond_to do |format|
      if @discussion.save