app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT * FROM "documents"

  def show
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 0)

  def create
    @document = Document.new(params[:document])
    @document.user_id = current_user.id

    respond_to do |format|
      if @document.save
---
INSERT INTO "documents" ("rating", "updated_at", "title", "body", "version", "user_id", "allow_comments", "created_at") VALUES(NULL, '2009-04-11 06:09:09', 'First Document', 'The document here is the greatest thing.', 1, NULL, 't', '2009-04-11 06:09:09')